export const ITEM_NAMES: string[] = [
  // タイプ強化
  'シルクのスカーフ', 'もくたん', 'しんぴのしずく', 'じしゃく', 'きせきのタネ',
  'とけないこおり', 'くろおび', 'どくバリ', 'やわらかいすな', 'するどいくちばし',
  'まがったスプーン', 'ぎんのこな', 'かたいいし', 'のろいのおふだ', 'りゅうのキバ',
  'くろいメガネ', 'メタルコート', 'ようせいのハネ',
  // 特殊どうぐ
  'こだわりスカーフ', 'きあいのタスキ', 'きあいのハチマキ', 'たべのこし', 'かいがらのすず',
  'ひかりのこな', 'おうじゃのしるし', 'ピントレンズ', 'せんせいのツメ', 'しろいハーブ',
  'メンタルハーブ', 'でんきだま',
  // 状態異常回復きのみ
  'ラムのみ', 'カゴのみ', 'クラボのみ', 'チーゴのみ', 'モモンのみ', 'ナナシのみ', 'キーのみ', 'ヒメリのみ',
  // HP回復きのみ
  'オボンのみ', 'オレンのみ',
  // 耐性きのみ
  'オッカのみ', 'イトケのみ', 'ソクノのみ', 'リンドのみ', 'ヤチェのみ', 'ヨプのみ',
  'ビアーのみ', 'シュカのみ', 'バコウのみ', 'ウタンのみ', 'タンガのみ', 'ヨロギのみ',
  'カシブのみ', 'ハバンのみ', 'ナモのみ', 'リリバのみ', 'ロゼルのみ', 'ホズのみ',
]
