export const MOVE_NAMES: string[] = [
  // 優先度技
  'でんこうせっか', 'アクアジェット', 'バレットパンチ', 'かげうち', 'マッハパンチ',
  'こおりのつぶて', 'タネマシンガン', 'ふいうち', 'ねこだまし', 'まもる', 'みきり',
  // ノーマル
  'すてみタックル', 'のしかかり', 'おんがえし', 'ハイパーボイス', 'ばくおんぱ',
  'はかいこうせん', 'ギガインパクト', 'つるぎのまい', 'こうそくいどう', 'めいそう',
  'ほえる', 'はらだいこ', 'トリックルーム', 'リフレクター', 'ひかりのかべ', 'みがわり',
  'アンコール', 'このゆびとまれ', 'いかりのこな', 'ほろびのうた', 'ふきとばし', 'かたきうち',
  // ほのお
  'フレアドライブ', 'かえんほうしゃ', 'だいもんじ', 'オーバーヒート', 'ブラストバーン',
  'ほのおのうず', 'ニトロチャージ', 'ほのおのキバ', 'かえんぐるま', 'ブレイズキック', 'ねっぷう',
  'おにび', 'にほんばれ',
  // みず
  'ハイドロポンプ', 'なみのり', 'アクアテール', 'ウォーターフォール', 'ハイドロカノン',
  'アクアブレイク', 'ねっとう', 'うずしお', 'みずのはどう', 'クラブハンマー', 'あまごい',
  // でんき
  '10まんボルト', 'かみなり', 'かみなりパンチ', 'ボルテッカー', 'ワイルドボルト',
  'でんきショック', 'スパーク', 'らいげき', 'でんじは', 'かみなりのキバ', 'エレキボール',
  // くさ
  'ソーラービーム', 'リーフストーム', 'エナジーボール', 'パワーウィップ', 'リーフブレード',
  'タネバクダン', 'くさむすび', 'ギガドレイン', 'メガドレイン', 'やどりぎのタネ',
  'ねむりごな', 'どくのこな', 'コットンガード',
  // こおり
  'ふぶき', 'れいとうビーム', 'れいとうパンチ', 'つらら落とし', 'こおりのキバ',
  'フリーズドライ', 'こごえるかぜ',
  // かくとう
  'インファイト', 'クローズコンバット', 'きしかいせい', 'ばかぢから', 'メガトンキック',
  'とびひざげり', 'ドレインパンチ', 'きあいだま', 'アームハンマー', 'かわらわり',
  'はどうだん',
  // どく
  'ヘドロばくだん', 'ヘドロウェーブ', 'どくづき', 'アシッドボム', 'クロスポイズン',
  'どくどく', 'どくびし', 'ベノムショック',
  // じめん
  'じしん', 'だいちのちから', 'じならし', 'アースパワー', 'ドリルライナー',
  'マグニチュード', 'ガリョウテンセイ',
  // ひこう
  'ブレイブバード', 'エアスラッシュ', 'そらをとぶ', 'ぼうふう', 'アクロバット',
  'ハリケーン', 'つばさでうつ', 'とびかかる', 'ドリルくちばし', 'おいかぜ',
  // エスパー
  'サイコキネシス', 'サイコショック', 'サイコブレイク', 'ミラーコート', 'サイコカッター',
  'トリック', 'テレキネシス', 'バリアー', 'ちょうはつ', 'ねごと', 'じこあんじ',
  // むし
  'メガホーン', 'シザークロス', 'むしくい', 'シグナルビーム', 'みだれひっかき',
  'むしのさざめき', 'ストリングショット', 'まきびし', 'ねばねばネット', 'ちょうのまい',
  // いわ
  'ストーンエッジ', 'いわなだれ', 'がんせきふうじ', 'いわおとし', 'パワージェム',
  'ダイヤモンドストーム', 'ステルスロック', 'ワイドガード',
  // ゴースト
  'シャドーボール', 'シャドークロー', 'たたりめ', 'おどろかす', 'みちづれ', 'のろい',
  'シャドーダイブ', 'ポルターガイスト',
  // ドラゴン
  'りゅうせいぐん', 'げきりん', 'ドラゴンクロー', 'りゅうのはどう', 'ドラゴンダイブ',
  'ドラゴンテール', 'ドラゴンエネルギー', 'スケイルノイズ', 'りゅうのまい',
  // あく
  'かみくだく', 'イカサマ', 'バークアウト', 'はたきおとす', 'ナイトヘッド', 'つじぎり',
  'おきみやげ', 'ほかく',
  // はがね
  'アイアンヘッド', 'コメットパンチ', 'メタルクロー', 'フラッシュキャノン', 'アイアンテール',
  'ジャイロボール', 'ヘビーボンバー', 'スチールウィング',
  // フェアリー
  'ムーンフォース', 'マジカルシャイン', 'じゃれつく', 'ドレインキッス', 'チャームボイス',
  'ミストフィールド', 'フェアリーロック',
  // フィールド
  'エレキフィールド', 'グラスフィールド', 'サイコフィールド',
  // 天候
  'すなあらし', 'あられ',
]
